&НаКлиенте
перем НаценкаНаУслугу;
перем СтокЗаголовок;

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущийДокумент = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	НаценкаНаУслугу = 1.5;
	Красный = Элементы.ПереченьНоменклатурыЦена.ЦветФона.Красный;
	Элементы.ПереченьНоменклатурыЦена.ЦветФона = Новый Цвет(77, 240, 26);
	ТекущийДокумент = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.СделатьНаценку(ТекущийДокумент, НаценкаНаУслугу);
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Элемент)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
		Объект.Дата, СтрокаТабличнойЧасти.Номенклатура
	);
	Сообщить("Получена последняя цена из регистра сведений");
	// Пересчитать сумму строки
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
