&НаКлиенте
перем НаценкаНаУслугу;
перем СтокЗаголовок;

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	Сообщить("Выполнеение процедуры при изменении значениия Количества формы ПереченьНоменклатуры");
	ТекущийДокумент = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	НаценкаНаУслугу = 1.5;
	Красный = Элементы.ПереченьНоменклатурыЦена.ЦветФона.Красный;
	Элементы.ПереченьНоменклатурыЦена.ЦветФона = Новый Цвет(77, 240, 26);
	Сообщить("Выполнеение процедуры при изменении значениия Цена формы ПереченьНоменклатуры");
	ТекущийДокумент = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.СделатьНаценку(ТекущийДокумент, НаценкаНаУслугу);
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Элемент)
	Закрыть();
КонецПроцедуры
