&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	Сообщить("Выполнении процедуры при изменении значения Количества формы ПриходнаяНакланая");
	ТекущийДокумент = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	Сообщить("Выполнении процедуры при изменении значения Цена формы ПриходнаяНакланая");
	ТекущийДокумент = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(ТекущийДокумент);
КонецПроцедуры
